Белгипрозем_2017/src/Catalogs/СоглашенияОбИспользованииЭД/СоглашенияОбИспользованииЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоглашенияОбИспользованииЭД</name>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФорматаПакета</name>
    <type>
      <types>EnumRef.ВерсииФорматаПакетаЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассивноеСоединениеFTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортFTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьСертификатыПодписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаБанка</name>
    <type>
      <types>EnumRef.ПрограммыБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВходящихДокументов</name>
    <type>
      <types>String</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсИсходящихДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатКонтрагентаДляШифрования</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатОрганизацииДляРасшифровки</name>
    <type>
      <types>CatalogRef.СертификатыЭП</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбменаЭД</name>
    <type>
      <types>EnumRef.СпособыОбменаЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСоглашения</name>
    <type>
      <types>EnumRef.СтатусыСоглашенийЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповоеСоглашение</name>
    <type>
      <types>CatalogRef.СоглашенияОбИспользованииЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЛогинАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПартнер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСертификатАбонента</name>
    <type>
      <types>CatalogRef.СертификатыЭП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИнтеркампани</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТиповое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеобходимыхПодписей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВходящиеДокументы</name>
    <attributes>
      <name>ВходящийДокумент</name>
      <type>
        <types>EnumRef.ВидыЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьЭП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОжидатьКвитанциюОДоставке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсходящиеДокументы</name>
    <attributes>
      <name>ИсходящийДокумент</name>
      <type>
        <types>EnumRef.ВидыЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьЭП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОжидатьКвитанциюОДоставке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияФормата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыПодписейКонтрагента</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФорматыФайловОбмена</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматФайла</name>
      <type>
        <types>EnumRef.ФорматыФайловОбменаЭД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыПодписейОрганизации</name>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыЭП</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКонтейнера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Enums/ВидыЭД/ВидыЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭД</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>АктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ДопДанные</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйЭД</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиОтправитель</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Продавец</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>ШтампБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/СпособыОбменаЭД/СпособыОбменаЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОбменаЭД</name>
  <enumValues>
    <name>БыстрыйОбмен</name>
  </enumValues>
  <enumValues>
    <name>ЧерезFTP</name>
  </enumValues>
  <enumValues>
    <name>ЧерезКаталог</name>
  </enumValues>
  <enumValues>
    <name>ЧерезОператораЭДОТакском</name>
    <comment>Через оператора электронного документооборота Такском</comment>
  </enumValues>
  <enumValues>
    <name>ЧерезСервис1СЭДО</name>
  </enumValues>
  <enumValues>
    <name>ЧерезЭлектроннуюПочту</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЧерезВебРесурсБанка</name>
  </enumValues>
  <enumValues>
    <name>Через1СБизнесСеть</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/СтатусыСоглашенийЭД/СтатусыСоглашенийЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСоглашенийЭД</name>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
  <enumValues>
    <name>НеСогласовано</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВДокументах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенныеВебСерверы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПереписке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПерепискеСРангом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/СоглашенияОбИспользованииЭД/Forms/ПомощникНового/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимОткрытияОкна") Тогда
		ЭтаФорма.РежимОткрытияОкна = Параметры.РежимОткрытияОкна;
	КонецЕсли;

	Элементы.СтраницыПодвал.ОтображениеСтраниц    = ОтображениеСтраницФормы.Нет;
	Элементы.СтраницыПомощника.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	// Скроем не разделенные константы в разделенном режиме сервиса
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Элементы.ГруппаКонтекст.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЭтоПлатформа83() Тогда
		Элементы.Сертификат.КнопкаСоздания = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СогласенСУсловиями = Истина;
	ЭлектронныеДокументыКлиентПереопределяемый.ЗапроситьСогласиеСУсловиямиЛицензионногоСоглашения(СогласенСУсловиями);
	Если СогласенСУсловиями <> Истина Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ПодключитьРасширениеРаботыСКриптографией() Тогда
		ТекстПредупреждения = НСтр("ru = 'Для работы с помощником ввода соглашения через оператора Такском
                                    |необходимо установить расширение работы с криптографией.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.Далее2.КнопкаПоУмолчанию = Истина;
	УстановитьДоступностьВидимостьЭлементовСтраницыСертификата();
	Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаДобавленияСертификата;
	Элементы.СтраницыПодвал.ТекущаяСтраница    = Элементы.СтраницаКнопкиНазадДалее;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаСертификат) И Не БылЗаданВопросПриЗакрытии Тогда
		ТекстВопроса = НСтр("ru = 'При закрытии помощника данные не будут сохранены'");
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Закрыть");
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Продолжить");
		Обработчик = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Обработчик, ТекстВопроса, СписокКнопок, 30, КодВозвратаДиалога.Нет);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Ответ, ПараметрыВыполнения) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		БылЗаданВопросПриЗакрытии = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ЗначениеЗаполнено(СсылкаНаСертификат) Тогда
		УдалитьИзВременногоХранилища(СсылкаНаСертификат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Пользователи") Тогда
		Пользователь = ВыбранноеЗначение;
		ЗаполнитьЗаголовкиГиперссылокСтраницыСертификата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ИнтернетПоддержкаПользователей
	
	// Механизм получения уникального идентификатора передает уникальный идентификатор
	// в виде строки в параметре оповещения с именем события
	// "ОповещениеОПолученииУникальногоИдентификатораУчастникаОбменаЭД"
	Если ИмяСобытия = "ОповещениеОПолученииУникальногоИдентификатораУчастникаОбменаЭД" Тогда
		ИдентификаторОрганизации = СокрЛП(Параметр);
		
		ШаблонСообщения = НСтр("ru = 'Идентификатор: %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Параметр);
		Элементы.НадписьИдентификаторУчастникаОбменаЭД.Заголовок = ТекстСообщения;
		Элементы.НадписьИдентификаторУчастникаОбменаЭД.Гиперссылка = Ложь;
		ШрифтЭлемента = Элементы.НадписьИдентификаторУчастникаОбменаЭД.Шрифт;
		Элементы.НадписьИдентификаторУчастникаОбменаЭД.Шрифт = Новый Шрифт(ШрифтЭлемента, , , Истина);
	КонецЕсли;
	// Конец ИнтернетПоддержкаПользователей
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		Если Параметр = СертификатКриптографии Тогда
			ЗаполнитьРеквизитыСертификатаНаСервере(СертификатКриптографии);
			ЗаполнитьЗаголовкиГиперссылокСтраницыСертификата();
			УстановитьДоступностьВидимостьЭлементовСтраницыСертификата();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СброситьДанныеПоИдентификаторуОрганизации();
	НаименованиеСоглашения = Элементы.Организация.ТекстРедактирования;
	СброситьНастройкиСертификата();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьИдентификаторУчастникаОбменаЭДНажатие(Элемент)
	
	ТекСертификат = СертификатКриптографии;
	ЭлектронныеДокументыКлиентПереопределяемый.СтартоватьМеханизмРаботыСОператоромЭДО(ТекСертификат,
																					  Организация,
																					  "taxcomGetID",
																					  ИдентификаторОрганизации,
																					  ПарольПользователя,
																					  ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьЛичныйКабинетУчастникаОбменаЭДНажатие(Элемент)
	
	ТекСертификат = СертификатКриптографии;

	ЭлектронныеДокументыКлиентПереопределяемый.СтартоватьМеханизмРаботыСОператоромЭДО(ТекСертификат,
																					  Организация,
																					  "taxcomPrivat",
																					  ИдентификаторОрганизации,
																					  ПарольПользователя,
																					  ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Назад(Команда)
	
	ОчиститьСообщения();
	Если Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаНастройкиСоглашения Тогда
		Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаДобавленияСертификата;
		Элементы.СтраницыПодвал.ТекущаяСтраница    = Элементы.СтраницаКнопкиНазадДалее;
		Элементы.Далее2.КнопкаПоУмолчанию          = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ОчиститьСообщения();
	
	Если Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаДобавленияСертификата Тогда
		
		Обработчик = Новый ОписаниеОповещения("ТестСертификатаЗавершение", ЭтотОбъект);
		ТестСертификата(Обработчик);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТестСертификатаЗавершение(ТестВыполненУспешно, ПараметрыВыполнения) Экспорт
	
	Если НЕ ТестВыполненУспешно Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаНастройкиСоглашения;
	Элементы.СтраницыПодвал.ТекущаяСтраница    = Элементы.СтраницаКнопкиГотово;
	Элементы.Готово.КнопкаПоУмолчанию          = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	ОчиститьСообщения();
	
  	Обработчик = Новый ОписаниеОповещения("ТестСоглашенияЗавершение", ЭтотОбъект);
	ТестСоглашения(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСоглашенияЗавершение(Результат, ПараметрыВыполнения) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСохранены = Истина;
	СохранитьПараметры(ДанныеСохранены);
	Если ДанныеСохранены Тогда
		ПоказатьОповещениеПользователя("Создание",
									   ПолучитьНавигационнуюСсылку(СсылкаНаСоглашение),
									   СсылкаНаСоглашение);
		Оповестить("ОбновитьСостояниеЭД");
		ПоказатьЗначение(, СсылкаНаСоглашение);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ЗаполнитьСтруктуруСертификатаПоОтпечаткуНаКлиенте(Отпечаток)
	
	ДвоичныеДанныеОтпечатка = Base64Значение(Отпечаток);
	
	Отказ = Ложь;
	МенеджерКриптографии = ЭлектроннаяПодписьКлиент.ПолучитьМенеджерКриптографии(Отказ);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	Сертификат = ХранилищеСертификатов.НайтиПоОтпечатку(ДвоичныеДанныеОтпечатка);
	
	Если Сертификат = Неопределено Тогда
		ТекстПредупреждения = НСтр("ru = 'Выбранный сертификат не найден в хранилище личных.
                                    |Установите сертификат самостоятельно или обратитесь к администратору.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураСертификата = ЭлектроннаяПодписьКлиентСервер.ЗаполнитьСтруктуруСертификата(Сертификат);
	СтруктураСертификата.Вставить("ДвоичныеДанныеСертификата", Сертификат.Выгрузить());
	
	Возврат СтруктураСертификата;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСертификатПоОтпечаткуНаКлиенте(Отпечаток)
	
	ДвоичныеДанныеОтпечатка = Base64Значение(Отпечаток);
	
	Отказ = Ложь;
	МенеджерКриптографии = ЭлектроннаяПодписьКлиент.ПолучитьМенеджерКриптографии(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ХранилищеСертификатов = Неопределено;
	ХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	
	Сертификат = ХранилищеСертификатов.НайтиПоОтпечатку(ДвоичныеДанныеОтпечатка);
	
	ДвоичныеДанныеСертификата = Сертификат.Выгрузить();
		
	СсылкаНаСертификат = ПоместитьВоВременноеХранилище(ДвоичныеДанныеСертификата, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьВидимостьЭлементовСтраницыСертификата()
	
	ЗаполнитьЗаголовкиГиперссылокСтраницыСертификата();
	
	Элементы.НаименованиеСертификата.ТолькоПросмотр   = Истина;
	Элементы.Фамилия.ТолькоПросмотр                   = Истина;
	Элементы.Имя.ТолькоПросмотр                       = Истина;
	Элементы.Отчество.ТолькоПросмотр                  = Истина;
	Элементы.ДолжностьПоСертификату.ТолькоПросмотр    = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаголовкиГиперссылокСтраницыСертификата()
	
	Если НЕ ОграничитьДоступКСертификату Тогда
		ТекстГиперссылкиПользователя = Нстр("ru = 'Доступен всем пользователям.'");
	Иначе
		ТекстГиперссылкиПользователя = Нстр("ru = 'Доступен пользователю:'") + " "
									+ ?(ЗначениеЗаполнено(Пользователь), Пользователь, Нстр("ru = '<Выбрать пользователя>'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСертификата(ОписаниеОповещения)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Организация"),
			,
			"Организация",
			,
			Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НаименованиеСертификата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Наименование сертификата"),
			,
			"НаименованиеСертификата",
			,
			Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СертификатКриптографии) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Сертификат"),
			,
			"СертификатКриптографии",
			,
			Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Фамилия) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Фамилия"),
			,
			"Фамилия",
			,
			Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Имя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Имя"),
			,
			"Имя",
			,
			Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДолжностьПоСертификату) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Должность"),
			,
			"ДолжностьПоСертификату",
			,
			Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Для дальнейших операций необходим пароль сертификата.
	Представление = СертификатКриптографии;
	ПараметрыСертификата = ЭлектронныеДокументыСлужебныйВызовСервера.РеквизитыСертификата(СертификатКриптографии);

	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ПараметрыСертификата", ПараметрыСертификата);
	ПараметрыВыполнения.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	
	Обработчик = Новый ОписаниеОповещения("ТестСертификатаПослеВводаПароляКСертификату", ЭтотОбъект, ПараметрыВыполнения);
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьПарольКСертификатуАсинхронно(
		Представление,
		ПараметрыСертификата,
		НСтр("ru = 'Проверка сертификата'"),,
		Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСертификатаПослеВводаПароляКСертификату(Результат, ПараметрыВыполнения) Экспорт
	
	Если Не Результат.ПарольПолучен Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Результат.СтруктураВозврата;
	ПараметрыСертификата = ПараметрыВыполнения.ПараметрыСертификата;
	
	ПараметрыСертификата.Вставить("ЗапомнитьПарольКСертификату", СтруктураВозврата.ЗапомнитьПарольКСертификату);
	ПараметрыСертификата.Вставить("ПарольПользователя",          СтруктураВозврата.ПарольПользователя);
	ПараметрыСертификата.Вставить("НастройкиКриптографии",       СтруктураВозврата.НастройкиКриптографии);
	
	ТекПарольПользователя = Неопределено;
	ТекПарольПользователя = ПараметрыСертификата.ПарольПользователя;
	ЗапомнитьПарольКСертификату = ПараметрыСертификата.ЗапомнитьПарольКСертификату;
	
	Результат = ТестСертификатаНаКлиенте(ТекПарольПользователя);
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОписаниеОповещения, Результат);
	
КонецПроцедуры
	
&НаСервере
Функция Отпечаток(СсылкаНаСертификат)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаСертификат, "Отпечаток");
	
КонецФункции

&НаКлиенте
Функция ТестСертификатаНаКлиенте(ТекущийПароль)
			
	ШаблонСообщения = НСтр("ru = '%1
								 |%2'");
	
	// Блок проверки наличия сертификата в хранилище сертификатов компьютера.
	ОписаниеТеста = НСтр("ru = 'Тест. Проверка наличия сертификата на клиенте.'");
	
	Отпечаток = Отпечаток(СертификатКриптографии);
	ДвоичныеДанныеОтпечатка = Base64Значение(Отпечаток);
	МенеджерКриптографииДляХранилища = ЭлектроннаяПодписьКлиент.ПолучитьМенеджерКриптографии();
	ХранилищеСертификатов = МенеджерКриптографииДляХранилища.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	Сертификат = ХранилищеСертификатов.НайтиПоОтпечатку(ДвоичныеДанныеОтпечатка);
	
	Если Сертификат = Неопределено Тогда
		РезультатТеста = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьСообщениеОбОшибке("101");
	КонецЕсли;
	Если ЗначениеЗаполнено(РезультатТеста) Тогда 
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
																				 ОписаниеТеста,
																				 РезультатТеста);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	// Критичная ошибка - дальше тесты не проводим, будет ошибка платформы.
	Если Сертификат = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
		
	НастройкиКриптографии = РаботаСЭП.ПрофильНастроекКриптографииПоСертификату(Отпечаток);
	МенеджерКриптографии = ЭлектроннаяПодписьКлиент.ПолучитьМенеджерКриптографии(Ложь, НастройкиКриптографии);
	МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ТекущийПароль;
	
	Результат = Истина;
	// Блок проверки сертификата на корректность.
	ОписаниеТеста = НСтр("ru = 'Тест. Проверка реквизитов сертификата на клиенте.'");
	Попытка
		МенеджерКриптографии.ПроверитьСертификат(Сертификат, РежимПроверкиСертификатаКриптографии.РазрешитьТестовыеСертификаты);
	Исключение
		ШаблонРезультата = НСтр("ru = '%1
		|%2'");
		ТекстОшибки = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьСообщениеОбОшибке("102");
		РезультатТеста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонРезультата, 
																				 ТекстОшибки,
																				 КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Результат = Ложь;
	КонецПопытки;
	Если ЗначениеЗаполнено(РезультатТеста) Тогда 
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
																				 ОписаниеТеста,
																				 РезультатТеста);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	// Блок проверки шифрования/расшифрования.
	ОтпечатокДвоичныеДанные = Base64Значение(Отпечаток);
	
	РезультатТеста = "";
	ОписаниеТеста = НСтр("ru = 'Тест. Проверка операций шифрования/расшифровки на клиенте.'");
	ДвоичныеДанные = МенеджерКриптографии.Зашифровать(ОтпечатокДвоичныеДанные, Сертификат);
	Попытка
		РасшифрованныеДвоичныеДанные = МенеджерКриптографии.Расшифровать(ДвоичныеДанные);
	Исключение
		РезультатТеста = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьСообщениеОбОшибке("103");
		Результат = Ложь;
	КонецПопытки;
	Если ЗначениеЗаполнено(РезультатТеста) Тогда 
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
									ОписаниеТеста,
									РезультатТеста);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

	// Блок проверки ЭП.
	РезультатТеста = "";
	ОписаниеТеста = НСтр("ru = 'Тест. Проверка операций формирования/проверки ЭП на клиенте.'");
	Попытка
		ДвоичныеДанные = МенеджерКриптографии.Подписать(Сертификат.Отпечаток, Сертификат);
		ЭлектроннаяПодписьКлиент.ПроверитьПодпись(МенеджерКриптографии, Сертификат.Отпечаток, ДвоичныеДанные);
	Исключение
		ШаблонРезультата = НСтр("ru = '%1
		|%2'");
		ТекстОшибки = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьСообщениеОбОшибке("104");
		РезультатТеста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонРезультата, ТекстОшибки,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Результат = Ложь;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(РезультатТеста) Тогда 
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
																				 ОписаниеТеста,
																				 РезультатТеста);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СброситьДанныеПоИдентификаторуОрганизации()
	
	Если Элементы.ИдентификаторОрганизации.Видимость = Ложь Тогда
		ИдентификаторОрганизации = "";
		Элементы.НадписьИдентификаторУчастникаОбменаЭД.Заголовок = НСтр("ru = 'Получить уникальный идентификатор участника обмена ЭД.'");
		ШрифтЭлемента = Элементы.НадписьИдентификаторУчастникаОбменаЭД.Шрифт;
		Элементы.НадписьИдентификаторУчастникаОбменаЭД.Шрифт = Новый Шрифт(ШрифтЭлемента, , , Ложь);
		Элементы.НадписьИдентификаторУчастникаОбменаЭД.Гиперссылка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройкиСертификата()
	
	НазначениеСертификата                             = "";
	НаименованиеСертификата                           = "";
	ДатаОкончания                                     = Дата(1,1,1);
	ОграничитьДоступКСертификату                      = Ложь;
	Пользователь                                      = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
	Фамилия                                           = "";
	Имя                                               = "";
	Отчество                                          = "";
	ДолжностьПоСертификату                            = "";
	Элементы.Фамилия.ТолькоПросмотр                   = Ложь;
	Элементы.Имя.ТолькоПросмотр                       = Ложь;
	Элементы.Отчество.ТолькоПросмотр                  = Ложь;
	Элементы.ДолжностьПоСертификату.ТолькоПросмотр    = Ложь;
	
	Элементы.НаименованиеСертификата.ТолькоПросмотр   = Ложь;
	
	УстановитьДоступностьВидимостьЭлементовСтраницыСертификата();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСоглашения(ОписаниеОповещения)
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(НаименованиеСоглашения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Наименование соглашения"),
			,
			"НаименованиеСоглашения",
			,
			Отказ);
	КонецЕсли;
	
	Если Элементы.ИдентификаторОрганизации.Видимость И НЕ ЗначениеЗаполнено(ИдентификаторОрганизации) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Идентификатор организации"),
			,
			"ИдентификаторОрганизации",
			,
			Отказ);
	ИначеЕсли Элементы.ИдентификаторОрганизации.Видимость И ЗначениеЗаполнено(ИдентификаторОрганизации) Тогда
		ИдентификаторОрганизации = СокрЛП(ИдентификаторОрганизации);
		ДлинаИдентификатора = СтрДлина(ИдентификаторОрганизации);
		Если ДлинаИдентификатора <> 46 Тогда
			ТекстСообщения = ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения(
																	"Поле",
																	"КОРРЕКТНОСТЬ",
																	"Идентификатор организации",
																	,
																	,
																	Нстр("ru = 'Длина поля не равна 46.'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
		
	Если Элементы.ИдентификаторОрганизации.Видимость = Ложь И НЕ ЗначениеЗаполнено(ИдентификаторОрганизации) Тогда
		ТекстСообщения = Нстр("ru = 'Необходимо получить уникальный идентификатор участника обмена ЭД'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , ,Отказ);
	КонецЕсли;
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	Обработчик = Новый ОписаниеОповещения("ТестСвязиСТакскомЗавершение", ЭтотОбъект, ПараметрыВыполнения);
	ТестСвязиСТакском(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСвязиСТакскомЗавершение(ТестСвязиПройден, ПараметрыВыполнения) Экспорт
	
	Если НЕ ТестСвязиПройден Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОписаниеОповещения, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНазначениеСертификата(Назначение, НовоеНазначение, ДобавлятьКодНазначения = Ложь)
	
	ЭлектроннаяПодпись.ЗаполнитьНазначениеСертификата(Назначение, НовоеНазначение, ДобавлятьКодНазначения);
	
КонецПроцедуры

&НаСервере
Процедура ФамилияИнициалыФизЛица(ФИОВладельца, Фамилия, Имя, Отчество)
	
	ЭлектронныеДокументы.ФамилияИнициалыФизЛица(ФИОВладельца, Фамилия, Имя, Отчество);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыСертификатаНаСервере(СертификатСсылка)
	
	РеквизитыСертификата = ЭлектронныеДокументыСлужебныйВызовСервера.РеквизитыСертификата(СертификатСсылка);
	
	ЗапомнитьПарольКСертификату  = РеквизитыСертификата.ЗапомнитьПарольКСертификату;
	НазначениеСертификата        = РеквизитыСертификата.Назначение;
	ОграничитьДоступКСертификату = РеквизитыСертификата.ОграничитьДоступКСертификату;
	ОрганизацияПоСертификату     = РеквизитыСертификата.Организация;
	ПарольПользователя           = РеквизитыСертификата.ПарольПользователя;
	НаименованиеСертификата      = РеквизитыСертификата.Наименование;
	Пользователь                 = РеквизитыСертификата.Пользователь;
	
	Фамилия                      = РеквизитыСертификата.Фамилия;
	Имя                          = РеквизитыСертификата.Имя;
	Отчество                     = РеквизитыСертификата.Отчество;
	ДолжностьПоСертификату       = РеквизитыСертификата.ДолжностьПоСертификату;
	
	ДатаОкончания                = РеквизитыСертификата.ДатаОкончания;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = ОрганизацияПоСертификату;
	конецЕсли;
	СсылкаНаСертификат = ПоместитьВоВременноеХранилище(РеквизитыСертификата.ДвоичныеДанныеСертификата, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметры(ДанныеСохранены)
	
	Попытка
		НачатьТранзакцию();
		
		НовыйСертификат = НовыйСертификатСсылка.ПолучитьОбъект();
		АктуальныеЭД = ЭлектронныеДокументыПовтИсп.ПолучитьАктуальныеВидыЭД();
		Для Каждого ЗначениеПеречисления Из АктуальныеЭД Цикл
			Если ЗначениеПеречисления = Перечисления.ВидыЭД.Ошибка
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.Подтверждение
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ДопДанные
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ПлатежноеПоручение
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ЗапросВыписки
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ШтампБанка
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.Квитанция
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ЗапросНочнойВыписки
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ВозвратТоваровМеждуОрганизациями
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ПередачаТоваровМеждуОрганизациями
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.АктВыполненныхРабот
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.КаталогТоваров
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ТОРГ12
				ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ВыпискаБанка Тогда
					Продолжить;
			КонецЕсли;
			
			Если НовыйСертификат.ВидыДокументов.Найти(ЗначениеПеречисления, "ВидДокумента") = Неопределено Тогда 
				НоваяСтрокаТЧ = НовыйСертификат.ВидыДокументов.Добавить();
				НоваяСтрокаТЧ.ВидДокумента = ЗначениеПеречисления;
				НоваяСтрокаТЧ.ИспользоватьДляПодписи =
					ЗначениеПеречисления = Перечисления.ВидыЭД.ИзвещениеОПолучении
					ИЛИ ЗначениеПеречисления = Перечисления.ВидыЭД.ПроизвольныйЭД;
			КонецЕсли;
		КонецЦикла;
		НовыйСертификат.Организация = Организация;
		НовыйСертификат.Записать();
			
		НовоеСоглашение = Справочники.СоглашенияОбИспользованииЭД.СоздатьЭлемент();
		НовоеСоглашение.ИдентификаторОрганизации = ИдентификаторОрганизации;
		НовоеСоглашение.Наименование             = НаименованиеСоглашения;
		НовоеСоглашение.Организация              = Организация;
		НоваяСтрока = НовоеСоглашение.СертификатыПодписейОрганизации.Добавить();
		НоваяСтрока.Сертификат = СертификатКриптографии;
		НовоеСоглашение.СпособОбменаЭД           = Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском;
		НовоеСоглашение.СтатусСоглашения         = Перечисления.СтатусыСоглашенийЭД.Действует;
		Если НовоеСоглашение.СоглашениеУникально() Тогда
			НовоеСоглашение.Записать();
		Иначе
			ОтменитьТранзакцию();
			ДанныеСохранены = Ложь;
			Возврат;
		КонецЕсли;
		СсылкаНаСоглашение = НовоеСоглашение.Ссылка;
		
		ЗафиксироватьТранзакцию();
		ОбновитьПовторноИспользуемыеЗначения();
	Исключение
		ОтменитьТранзакцию();
		ДанныеСохранены = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСвязиСТакском(ОписаниеОповещения)
	
	СертификатПодписи = СертификатКриптографии;
	ЭлектронныеДокументыСлужебныйКлиент.ПроверитьСрокДействияСертификата(СертификатПодписи);
	
	ПараметрыСертификата = ЭлектронныеДокументыСлужебныйВызовСервера.РеквизитыСертификата(СертификатПодписи);
	ПараметрыСертификата.Вставить("СертификатПодписи", СертификатПодписи);
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	ПараметрыВыполнения.Вставить("ПараметрыСертификата", ПараметрыСертификата);
	Обработчик = Новый ОписаниеОповещения("ТестСвязиСТакскомПослеПолученияПароляКСертификату", ЭтотОбъект, ПараметрыВыполнения);
	ЭлектронныеДокументыСлужебныйКлиент.ПолучитьПарольКСертификатуАсинхронно(
		СертификатКриптографии,
		ПараметрыСертификата,
		НСтр("ru = 'Авторизация на сервере Такском'"),, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСвязиСТакскомПослеПолученияПароляКСертификату(Результат, ПараметрыВыполнения) Экспорт
	
	Если Не Результат.ПарольПолучен Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Результат.СтруктураВозврата;
	ПараметрыСертификата = ПараметрыВыполнения.ПараметрыСертификата;
	
	ПараметрыСертификата.Вставить("ЗапомнитьПарольКСертификату", СтруктураВозврата.ЗапомнитьПарольКСертификату);
	ПараметрыСертификата.Вставить("ПарольПользователя",          СтруктураВозврата.ПарольПользователя);
	ПараметрыСертификата.Вставить("НастройкиКриптографии",       СтруктураВозврата.НастройкиКриптографии);
	
	ТестПройден = ЭлектронныеДокументыСлужебныйКлиент.ТестСвязиСОператоромЭДО(ПараметрыСертификата, Ложь);
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОписаниеОповещения, ТестПройден);
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СертификатыЭП") Тогда
		
		СброситьНастройкиСертификата();
		ОчиститьСообщения();
		
		СтруктураВозврата = ЭлектронныеДокументыСлужебныйВызовСервера.РеквизитыСертификата(ВыбранноеЗначение);
		Отпечаток = СтруктураВозврата.Отпечаток;
		
		СтруктураСертификата = ЗаполнитьСтруктуруСертификатаПоОтпечаткуНаКлиенте(Отпечаток);
		Если СтруктураСертификата = Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		ПредставлениеСертификата = Организация;
		НаименованиеСертификата  = Организация;
		
		// Проверка сертификата на соответствие 63 ФЗ.
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.2.18.108") >= 0 Тогда
			
			НовыйСертификат = Новый СертификатКриптографии(СтруктураВозврата.ДвоичныеДанныеСертификата);
			Если Не НовыйСертификат.Субъект.Свойство("SN") Тогда
				
				ТекстСообщения = НСтр("ru = 'Сертификат не соответствует федеральному закону Российской Федерации от 6 апреля 2011 г. N 63-ФЗ ""Об электронной подписи"".
											|Рекомендуется перейти на квалифицированный сертификат ключа подписи (КСКП) по 63-ФЗ.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.СертификатыЭП.ПустаяСсылка");
				Возврат;
				
			КонецЕсли;
			
			// Корректно работаем только с сертификатами для подписи стандартной структуры.
			Если (НовыйСертификат.Субъект.Свойство("SN") ИЛИ НовыйСертификат.Субъект.Свойство("CN"))
				И НовыйСертификат.Субъект.Свойство("T") И НовыйСертификат.Субъект.Свойство("ST") Тогда
				
				Если НовыйСертификат.Субъект.Свойство("SN") Тогда
					
					ШаблонФИОВладельца = НСтр("ru = '%1 %2'");
					ФИОВладельца = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонФИОВладельца,
						НовыйСертификат.Субъект.SN, НовыйСертификат.Субъект.GN);
				ИначеЕсли НовыйСертификат.Субъект.Свойство("CN") Тогда
					
					ФИОВладельца = НовыйСертификат.Субъект.CN;
				КонецЕсли;
				ДолжностьПоСертификату = НовыйСертификат.Субъект.T;
				
				ФамилияИнициалыФизЛица(ФИОВладельца, Фамилия, Имя, Отчество);
				
				ПредставлениеСертификата = СтруктураСертификата.КомуВыдан;
				НаименованиеСертификата  = СтруктураСертификата.КомуВыдан;
				Пользователь = СтруктураВозврата.Пользователь;
				УстановитьДоступностьВидимостьЭлементовСтраницыСертификата();
			КонецЕсли;
		КонецЕсли;
		
		ШаблонНазначения = НСтр("ru = 'Кем выдан: %1
								|Действителен до: %2
								|
								|%3'");
		НовоеНазначение = "";
		ЗаполнитьНазначениеСертификата(СтруктураСертификата.Назначение, НовоеНазначение, Истина);
		НазначениеСертификата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНазначения,
			СтруктураСертификата.КемВыдан, СтруктураСертификата.ДействителенДо, НовоеНазначение);
		
		ПолучитьСертификатПоОтпечаткуНаКлиенте(Отпечаток);
		
		НовыйСертификатСсылка = ВыбранноеЗначение;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Фамилия) Тогда
		Элементы.Фамилия.Доступность = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Имя) Тогда
		Элементы.Имя.Доступность = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчество) Тогда
		Элементы.Отчество.Доступность = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДолжностьПоСертификату) Тогда
		Элементы.ДолжностьПоСертификату.Доступность  = Ложь;
	КонецЕсли;
	
КонецПроцедуры
